{
	"author": {
		"name": "Roei Sabag",
		"link": "https://www.linkedin.com/in/roei-sabag-247aa18/"
	},
	"categories": [
		"Loops"
	],
	"context": {
		"integration": {
			"sequentialWorkflow": {
				"$type": "Action",
				"componentType": "container",
				"iconProvider": "loop",
				"model": "ActionRuleModel"
			}
		}
	},
	"description": [
		"### Purpose",
		"",
		"The InvokeForLoop plugin runs a set of actions a specified number of times in your automation scripts. It makes repeating tasks simple by letting you define exactly how many loops to perform. This saves time and effort when you need predictable, repeated steps. It works equally well in RPA workflows and automated tests.",
		"",
		"### Key Features and Functionality",
		"",
		"| Feature                 | Description                                                             |",
		"|-------------------------|-------------------------------------------------------------------------|",
		"| Controlled Iteration    | Runs actions for a fixed number of loops as defined by the user.        |",
		"| Sequential Execution    | Executes each step in order within the loop for consistent outcomes.    |",
		"| Parameterized Iteration | Adjusts loop variables dynamically based on input values or conditions. |",
		"",
		"### Usages in RPA",
		"",
		"| Use Case                | Description                                                           |",
		"|-------------------------|-----------------------------------------------------------------------|",
		"| Data Processing         | Iterate over records or items to enter, validate, or transform data.  |",
		"| Batch Processing        | Perform a series of tasks on a predefined data set within a workflow. |",
		"| Parameterized Iteration | Change loop values at runtime to handle varying input automatically.  |",
		"",
		"### Usages in Automation Testing",
		"",
		"| Use Case            | Description                                                                          |",
		"|---------------------|--------------------------------------------------------------------------------------|",
		"| Test Case Iteration | Run test steps repeatedly to cover multiple scenarios.                               |",
		"| Data-Driven Testing | Loop through different data sets to verify application behavior under varied inputs. |",
		"| Load Testing        | Simulate repeated user actions to measure system performance under load.             |"
	],
	"examples": [
		{
			"description": [
				"Instructs the automation script to execute the `Click` action on the HTML element with the CSS selector `#NextBtn1` five times in sequential order."
			],
			"rule": {
				"argument": "5",
				"pluginName": "InvokeForLoop",
				"rules": [
					{
						"locator": "CssSelector",
						"onElement": "#NextBtn1",
						"pluginName": "Click"
					}
				]
			}
		},
		{
			"description": [
				"This configuration represents a usage of the `InvokeForLoop` plugin along with other actions in an automation scenario.",
				"",
				"1. **For Loop:**",
				"   - The loop is initiated by the `InvokeForLoop` plugin.",
				"   - It specifies that the enclosed actions will be executed a total of 2 times.",
				"",
				"2. **Nested Actions:**",
				"   - Within the loop, three actions are defined.",
				"   - The first action is another instance of the `InvokeForLoop` plugin, creating a nested loop.",
				"   - This nested loop also specifies 2 iterations and contains a single action to click on the element with the CSS selector `#NextBtn2`.",
				"",
				"3. **Next Actions:**",
				"   - After the nested loop completes its iterations, the script proceeds to the next action outside the loop, which is to click on the element with the CSS selector `#FirstBtn2`.",
				"   - Following this, another action is performed to click on the element with the CSS selector `#NextBtn1`.",
				"",
				"In summary, this configuration orchestrates a scenario where a set of actions is repeated a specific number of times within a loop structure created by the `InvokeForLoop` plugin. ",
				"The nested usage of the plugin demonstrates the flexibility to create complex automation workflows with repetitive actions executed in a controlled manner."
			],
			"rule": {
				"argument": "2",
				"pluginName": "InvokeForLoop",
				"rules": [
					{
						"argument": "2",
						"pluginName": "InvokeForLoop",
						"rules": [
							{
								"locator": "CssSelector",
								"onElement": "#NextBtn2",
								"pluginName": "Click"
							}
						]
					},
					{
						"locator": "CssSelector",
						"onElement": "#FirstBtn2",
						"pluginName": "Click"
					},
					{
						"locator": "CssSelector",
						"onElement": "#NextBtn1",
						"pluginName": "Click"
					}
				]
			}
		}
	],
	"key": "InvokeForLoop",
	"manifestVersion": 4,
	"pluginType": "Action",
	"properties": [
		{
			"description": [
				"Specifies the number of iterations the loop will execute. ",
				"This property indicates the fixed number of times the loop will iterate, providing control over the repetitive execution of actions within the loop. ",
				"Each action defined within the loop will be executed for the specified number of iterations, allowing for controlled and predictable automation workflows."
			],
			"mandatory": true,
			"name": "Argument",
			"type": "Number|Expression"
		},
		{
			"description": [
				"Define a sequence of actions or instructions to be executed within a loop or under specific conditions."
			],
			"mandatory": true,
			"name": "Rules",
			"type": "Array"
		}
	],
	"protocol": {
		"apiDocumentation": "None",
		"w3c": "None"
	},
	"scopes": [
		"Any"
	],
	"summary": [
		"The `InvokeForLoop` plugin enables efficient and controlled iteration over a predefined set of actions within automation scripts.",
		"It facilitates repetitive task automation by executing a specified number of iterations, making it essential for handling loops in RPA and automation testing.",
		"Key functionalities include controlled iteration, sequential execution of tasks, and parameterized iteration, enhancing flexibility and adaptability in automation workflows.",
		"Use cases include data processing, batch processing, parameterized iteration, test case iteration, data-driven testing, and load testing, ensuring comprehensive coverage and performance assessment."
	]
}
