{
	"aliases": [
		"Log"
	],
	"author": {
		"name": "Roei Sabag",
		"link": "https://www.linkedin.com/in/roei-sabag-247aa18/"
	},
	"categories": [
		"Logging"
	],
	"description": [
		"### Purpose",
		"",
		"The `WriteLog` plugin is designed to write log messages during the execution of automation scripts. ",
		"It is particularly useful for debugging, tracking the flow of execution, and recording important information.",
		"",
		"### Key Features and Functionality",
		"",
		"| Feature             | Description                                                                                     |",
		"|---------------------|-------------------------------------------------------------------------------------------------|",
		"| Logging Information | Logs the content of the `Argument` property to the log using the logging framework.             |",
		"| Debugging Aid       | Helps in understanding the flow of automation, capturing important events, or debugging issues. |",
		"",
		"### Usages in RPA",
		"",
		"| Usage               | Description                                                            |",
		"|---------------------|------------------------------------------------------------------------|",
		"| Execution Tracking  | Track the flow of execution by logging key points in the automation.   |",
		"| Debugging           | Capture log messages to help debug issues in the automation process.   |",
		"| Information Logging | Record important information during the execution of automation tasks. |",
		"",
		"### Usages in Automation Testing",
		"",
		"| Usage               | Description                                                                             |",
		"|---------------------|-----------------------------------------------------------------------------------------|",
		"| Test Execution Logs | Capture logs during test execution to understand the flow and state of tests.           |",
		"| Debugging Tests     | Log messages to help debug test failures or unexpected behavior during automated tests. |",
		"| Recording Test Data | Log test data and results for analysis and verification purposes.                       |"
	],
	"examples": [
		{
			"description": [
				"Logs a simple message during the execution of the automation script."
			],
			"rule": {
				"argument": "Logging a simple message",
				"pluginName": "WriteLog"
			}
		},
		{
			"description": [
				"Logs the value of a dynamic parameter during the execution of the automation script."
			],
			"rule": {
				"argument": "{{$Get-Parameter --Name:MyParam --Scope:Session}}",
				"pluginName": "WriteLog"
			}
		}
	],
	"key": "WriteLog",
	"manifestVersion": 4,
	"pluginType": "Action",
	"properties": [
		{
			"description": [
				"Specifies the message or information to be logged. This can be a static message or a dynamic value retrieved from parameters."
			],
			"mandatory": true,
			"name": "Argument",
			"type": "String|Expression"
		}
	],
	"protocol": {
		"apiDocumentation": "None",
		"w3c": "None"
	},
	"scopes": [
		"Any"
	],
	"summary": [
		"The `WriteLog` plugin logs information during the execution of automation scripts, aiding in debugging, tracking the flow of execution, and recording important information.",
		"It captures the content of the `Argument` property and logs it using the logging framework, providing valuable insights into the automation process.",
		"Key features include logging information, serving as a debugging aid, and helping in understanding the flow of automation by capturing important events.",
		"Common use cases include execution tracking, debugging, and information logging in RPA, as well as capturing test execution logs, debugging test failures, and recording test data in automation testing."
	]
}
