{
	"aliases": [
		"ClearContent"
	],
	"author": {
		"link": "https://www.linkedin.com/in/roei-sabag-247aa18/",
		"name": "Roei Sabag"
	},
	"categories": [
		"UserInterface"
	],
	"description": [
		"### Purpose",
		"",
		"The `ClearElementContent` plugin automates the process of clearing the content of input elements in automation workflows. ",
		"It provides a seamless and efficient mechanism for resetting input fields, ensuring that the desired elements are properly cleared before proceeding with further actions.",
		"",
		"### Key Features and Functionality",
		"",
		"| Feature           | Description                                                                              |",
		"|-------------------|------------------------------------------------------------------------------------------|",
		"| Standard Clearing | Clears the content of input elements using the standard clear method.                    |",
		"| Native Clearing   | Clears the content by simulating backspace key presses, mimicking a manual clear action. |",
		"| Delay Handling    | Supports the introduction of delays between key presses during the native clear process. |",
		"| Error Management  | Incorporates robust error handling to manage exceptions during the clearing process.     |",
		"",
		"### Usages in RPA",
		"",
		"| Usage                       | Description                                                                                     |",
		"|-----------------------------|-------------------------------------------------------------------------------------------------|",
		"| Form Resets                 | Automates the resetting of form fields to ensure clean state before data entry.                 |",
		"| Data Entry Preparation      | Clears input fields in preparation for new data entry tasks, ensuring accuracy and consistency. |",
		"| User Interaction Simulation | Mimics user behavior by simulating manual clear actions through backspace key presses.          |",
		"",
		"### Usages in Automation Testing",
		"",
		"| Usage                  | Description                                                                                             |",
		"|------------------------|---------------------------------------------------------------------------------------------------------|",
		"| Input Field Testing    | Validates the behavior of input fields by clearing their content before entering new test data.         |",
		"| State Management       | Ensures consistent test conditions by resetting input fields to a known state before test execution.    |",
		"| Error Scenario Testing | Simulates scenarios where input fields need to be cleared as part of error handling and recovery tests. |"
	],
	"examples": [
		{
			"description": [
				"Clear the content of the input element identified by the CSS selector `#inputField`. ",
				"This uses the standard clear method to reset the field, ensuring it is empty before further actions."
			],
			"rule": {
				"locator": "CssSelector",
				"onElement": "#inputField",
				"pluginName": "ClearElementContent"
			}
		},
		{
			"description": [
				"Clear the content of the input element identified by the CSS selector `#inputField` using native clear. ",
				"This mimics manual clearing by sending backspace key presses, effectively resetting the field."
			],
			"rule": {
				"argument": "{{$ --NativeClear}}",
				"locator": "CssSelector",
				"onElement": "#inputField",
				"pluginName": "ClearElementContent"
			}
		},
		{
			"description": [
				"Clear the content of the input element identified by the CSS selector `#inputField` using native clear with a delay of 500 milliseconds between key presses. ",
				"This simulates a more realistic user interaction by introducing pauses between backspace key presses."
			],
			"rule": {
				"argument": "{{$ --NativeClear --Delay:500}}",
				"locator": "CssSelector",
				"onElement": "#inputField",
				"pluginName": "ClearElementContent"
			}
		}
	],
	"key": "ClearElementContent",
	"manifestVersion": 4,
	"parameters": [
		{
			"description": [
				"Specifies the delay, in milliseconds, between each key press when performing a native clear action. ",
				"This delay helps to simulate a more realistic user interaction during the clearing process."
			],
			"mandatory": false,
			"name": "Delay",
			"type": "Number"
		},
		{
			"description": [
				"Indicates that the content should be cleared by simulating backspace key presses, mimicking a manual clear action. ",
				"This approach is useful for scenarios where a more human-like interaction is needed."
			],
			"mandatory": false,
			"name": "NativeClear",
			"type": "Switch"
		}
	],
	"pluginType": "Action",
	"properties": [
		{
			"description": [
				"Allows customization of the clear action by specifying additional instructions. ",
				"Options include introducing a delay between key presses or using native clear actions."
			],
			"mandatory": false,
			"name": "Argument",
			"type": "String|Expression"
		},
		{
			"description": [
				"Specifies the strategy or method used to locate the element whose content will be cleared during automation."
			],
			"mandatory": true,
			"name": "Locator",
			"type": "String"
		},
		{
			"description": [
				"Specifies the identifier or locator for the element whose content will be cleared during automation. ",
				"It indicates the target element where the clear action should be performed."
			],
			"mandatory": true,
			"name": "OnElement",
			"type": "String"
		}
	],
	"protocol": {
		"apiDocumentation": "https://www.w3.org/TR/webdriver/#element-clear",
		"w3c": "POST /session/{session id}/element/{element id}/clear"
	},
	"scope": [
		"Web",
		"MobileWeb",
		"OsNative"
	],
	"summary": [
		"The `ClearElementContent` plugin automates the process of clearing the content of input elements in automation tasks.",
		"In robotic process automation (RPA), it resets form fields and prepares them for data entry, ensuring accuracy and consistency.",
		"In automation testing, it validates input field behavior and manages test conditions by resetting fields before executing tests."
	]
}
