{
	"aliases": [
		"NotExists"
	],
	"author": {
		"link": "https://www.linkedin.com/in/roei-sabag-247aa18/",
		"name": "Roei Sabag"
	},
	"categories": [
		"Validations",
		"WebDriver"
	],
	"description": [
		"### Purpose",
		"",
		"The `ElementNotExists` plugin is designed to assert that a specified web element does not exist within an application or web browser during automated tasks. ",
		"Its primary goal is to ensure that automation scripts can validate the non-existence of elements, which is crucial for scenarios where the absence of specific elements must be confirmed before proceeding.",
		"",
		"### Key Features and Functionality",
		"",
		"| Feature                     | Description                                                                  |",
		"|-----------------------------|------------------------------------------------------------------------------|",
		"| Element Non-Existence Check | Validates that the specified web element does not exist during execution.    |",
		"| Seamless Integration        | Integrates smoothly with automation workflows to ensure elements are absent. |",
		"| Reliable Validation         | Provides reliable assertion to confirm the non-existence of web elements.    |",
		"",
		"### Usages in RPA",
		"",
		"| Usage                | Description                                                                                   |",
		"|----------------------|-----------------------------------------------------------------------------------------------|",
		"| Absence Verification | Confirms that specific elements are absent, ensuring they do not interfere with the workflow. |",
		"| Process Continuity   | Validates that elements do not exist to proceed with the workflow without interruptions.      |",
		"",
		"### Usages in Automation Testing",
		"",
		"| Usage                       | Description                                                                                              |",
		"|-----------------------------|----------------------------------------------------------------------------------------------------------|",
		"| Non-Existence State Testing | Ensures that specific elements do not exist during test scenarios, validating user interaction flows.    |",
		"| Workflow Validation         | Confirms that workflows proceed with the correct elements being absent, ensuring accurate test outcomes. |"
	],
	"examples": [
		{
			"description": [
				"Assert that a specific web element does not exist during the execution of automated tasks. ",
				"This is useful for validating scenarios where the absence of elements is expected to prevent interactions."
			],
			"rule": {
				"locator": "CssSelector",
				"onElement": "#myElement",
				"pluginName": "ElementNotExists"
			}
		},
		{
			"description": [
				"Perform an assertion to ensure a specific web element does not exist, validating the absence of the element during the execution of the automation script. ",
				"The `Assert` plugin is used to check this condition, and if the element does not exist, the assertion passes."
			],
			"rule": {
				"argument": "{{$ --Condition:ElementNotExists}}",
				"locator": "CssSelector",
				"onElement": "#myElement",
				"pluginName": "Assert"
			}
		}
	],
	"key": "ElementNotExists",
	"manifestVersion": 4,
	"pluginType": "Assertion",
	"properties": [
		{
			"description": [
				"Specifies the web element that is being validated for its non-existence. ",
				"This can be a CSS selector, XPath, or other locator strategy to identify the element."
			],
			"mandatory": true,
			"name": "OnElement",
			"type": "String|Expression"
		},
		{
			"description": [
				"Specifies the locator strategy used to identify the element for the non-existence validation. ",
				"Common strategies include CSS selectors, XPath, ID, and others."
			],
			"mandatory": false,
			"name": "Locator",
			"type": "String"
		}
	],
	"protocol": {
		"apiDocumentation": "https://www.w3.org/TR/webdriver/#find-element",
		"w3c": "GET /session/{session id}/element"
	},
	"scopes": [
		"Any"
	],
	"summary": [
		"The `ElementNotExists` plugin asserts that a specified web element does not exist within an application or web browser during automated tasks, ensuring that automation scripts validate the absence of elements.",
		"In robotic process automation (RPA), it confirms the correct elements are absent, preventing unnecessary interactions and enhancing workflow efficiency.",
		"In automation testing, it validates the non-existence of elements, ensuring accurate user interaction flows and test outcomes."
	]
}
