{
	"author": {
		"name": "Roei Sabag",
		"link": "https://www.linkedin.com/in/roei-sabag-247aa18/"
	},
	"categories": [
		"Http"
	],
	"context": {
		"integration": {
			"github": {
				"document": "https://github.com/g4-api/g4-plugins/blob/main/docs/HttpMethods/Post.md",
				"source": "https://github.com/g4-api/g4-plugins/blob/main/src/G4.Plugins.Common/HttpMethods/HttpPostMethod.cs"
			}
		}
	},
	"description": [
		"### Purpose",
		"",
		"The Post plugin lets your automation workflows send data to a server or API with an HTTP POST request.",
		"It uses the standard POST method to transmit information for processing by a specified resource.",
		"This makes it simple and reliable to automate data submissions across different systems.",
		"",
		"### Key Features and Functionality",
		"",
		"| Feature                    | Description                                                         |",
		"|----------------------------|---------------------------------------------------------------------|",
		"| Data Submission            | Sends data to a server or API using an HTTP POST request.           |",
		"| Dynamic URLs and Payloads  | Builds requests with changing URLs and data as needed.              |",
		"| Custom Headers             | Lets you add any HTTP headers to control the request.               |",
		"| Content Types and Encoding | Works with different data formats and encodings.                    |",
		"| Response Handling          | Captures status codes, headers, and response bodies for next steps. |",
		"",
		"### Usages in RPA",
		"",
		"| Use Case         | Description                                                                              |",
		"|------------------|------------------------------------------------------------------------------------------|",
		"| Data Submission  | Submit customer details or form entries to external systems or APIs.                     |",
		"| Workflow Actions | Trigger next steps based on the results of the data submission in an automated workflow. |",
		"",
		"### Usages in Automation Testing",
		"",
		"| Use Case                               | Description                                                                                |",
		"|----------------------------------------|--------------------------------------------------------------------------------------------|",
		"| API Data Creation                      | Automated tests send POST requests to create or update test data before running scenarios. |",
		"| Data Integrity Checks                  | Tests verify that the server processed the submitted data correctly.                       |",
		"| Regression Testing for Data Submission | Checks that data submission features still work correctly after system changes.            |",
		""
	],
	"examples": [
		{
			"context": {
				"annotations": {
					"edge_cases": [
						"Invalid URL format",
						"Network failure",
						"Non-200 HTTP response",
						"Request timeout",
						"Server error"
					],
					"expected_result": "The plugin sends an HTTP POST request to the specified URL and returns the server's response.",
					"notes": "Use the `argument` field to specify the target URL. This example does not include a request body or custom headers.",
					"use_case": "post_plugin_simple_request",
					"version": "1.0"
				},
				"labels": [
					"Automation",
					"Http",
					"Post"
				]
			},
			"description": [
				"### Simple HTTP POST Request",
				"",
				"The `Post` plugin sends an HTTP POST request to the specified URL using the `argument` field.",
				"This example does not include a request body or custom headers."
			],
			"rule": {
				"$type": "Action",
				"argument": "http://api.example.com/v1/connect",
				"pluginName": "Post"
			}
		},
		{
			"context": {
				"annotations": {
					"edge_cases": [
						"Authentication failure",
						"Header injection",
						"Invalid header format",
						"Invalid URL format",
						"Missing header parameter",
						"Network failure",
						"Non-200 HTTP response",
						"Request timeout",
						"Server error"
					],
					"expected_result": "The plugin sends an HTTP POST request with the specified Authorization header and returns the server's response.",
					"notes": "Use the `argument` field with placeholder syntax `{{$ ... }}` to wrap flags. Include headers using the `--Header:Key=Value` flag. Authentication uses the Basic scheme with credentials separated by a colon (`username:password`).",
					"use_case": "post_plugin_request_with_headers",
					"version": "1.0"
				},
				"labels": [
					"Authentication",
					"Automation",
					"Headers",
					"Http",
					"Post"
				]
			},
			"description": [
				"### HTTP POST Request with Headers",
				"",
				"The `Post` plugin sends an HTTP POST request to the specified URL and includes headers defined in the `argument` field.",
				"It sets the `Authorization` header using the Basic scheme with credentials formatted as `username:password`.",
				"This example does not include a request body."
			],
			"rule": {
				"$type": "Action",
				"argument": "{{$ --Url:http://api.example.com/v1/connect --Header:Authorization=Basic username:password}}",
				"pluginName": "Post"
			}
		},
		{
			"context": {
				"annotations": {
					"edge_cases": [
						"Content type unsupported",
						"Invalid JSON format",
						"Invalid URL format",
						"Large payload",
						"Network failure",
						"Non-200 HTTP response",
						"Request timeout",
						"Server error"
					],
					"expected_result": "The plugin sends an HTTP POST request with the specified JSON body and Content-Type header, then returns the server's response.",
					"notes": "Wrap flags in `{{$ ... }}`. Use `--Body:<JSON>` to supply a JSON-formatted request body. Use `--ContentType:<type>` to set the Content-Type header.",
					"use_case": "post_plugin_request_with_body_and_content_type",
					"version": "1.0"
				},
				"labels": [
					"Automation",
					"ContentType",
					"Http",
					"Json",
					"Post",
					"RequestBody"
				]
			},
			"description": [
				"### HTTP POST Request with Body and Content Type",
				"",
				"The `Post` plugin sends an HTTP POST request to the specified URL using the `argument` field.",
				"It includes a JSON-formatted request body and sets the `Content-Type` header accordingly.",
				"This example does not include additional custom headers."
			],
			"rule": {
				"$type": "Action",
				"argument": "{{$ --Url:http://api.example.com/v1/book --Body:{\"hotelName\":\"Luxury Hotel\",\"roomType\":\"Suite\"} --ContentType:application/json}}",
				"pluginName": "Post"
			}
		},
		{
			"context": {
				"annotations": {
					"edge_cases": [
						"Argument encoding unsupported",
						"Invalid JSON format",
						"Invalid URL format",
						"Network failure",
						"Non-200 HTTP response",
						"Request timeout",
						"Server error"
					],
					"expected_result": "The plugin sends an HTTP POST request to the specified URL with the given JSON body and encoding, then returns the server's response.",
					"notes": "Wrap flags in `{{$ ... }}`. Use `--Url:<url>` to set the URL, `--Body:<JSON>` to specify the JSON body, and `--Encoding:<encoding>` to set the request encoding (e.g., UTF8).",
					"use_case": "post_plugin_request_with_encoding",
					"version": "1.0"
				},
				"labels": [
					"Automation",
					"Encoding",
					"Http",
					"Json",
					"Post",
					"RequestBody"
				]
			},
			"description": [
				"### HTTP POST Request with Specified Encoding",
				"",
				"The `Post` plugin sends an HTTP POST request to the specified URL using the flags in the `argument` field.",
				"It includes a JSON-formatted request body and uses the specified text encoding for the request.",
				"This example sets the encoding to UTF8 and does not include custom headers."
			],
			"rule": {
				"$type": "Action",
				"argument": "{{$ --Url:http://api.example.com/v1/book --Body:{\"hotelName\":\"Luxury Hotel\",\"roomType\":\"Suite\"} --Encoding:UTF8}}",
				"pluginName": "Post"
			}
		},
		{
			"description": [
				"Use the `Post` plugin to send an HTTP POST request with form fields."
			],
			"rule": {
				"argument": "{{$ --Url:http://api.example.com/v1/book/encoded --ContentType:application/x-www-form-urlencoded --Field:HotelName=Luxury Hotel --Field:RoomType=Suite}}",
				"pluginName": "Post"
			}
		},
		{
			"description": [
				"Use the `Post` plugin to send an HTTP POST request and extract a specific attribute from the response."
			],
			"rule": {
				"argument": "{{$ --Url:http://api.example.com/v1/book/encoded}}",
				"onAttribute": "HotelName",
				"pluginName": "Post"
			}
		},
		{
			"description": [
				"Use the `Post` plugin to send an HTTP POST request and target elements using XPath."
			],
			"rule": {
				"argument": "{{$ --Url:http://api.example.com/v1/book/encoded}}",
				"onElement": "//response/HotelName",
				"pluginName": "Post"
			}
		},
		{
			"description": [
				"Use the `Post` plugin to send an HTTP POST request and apply a regular expression to extract specific data from the response."
			],
			"rule": {
				"argument": "{{$ --Url:http://api.example.com/v1/book/encoded}}",
				"pluginName": "Post",
				"regularExpression": "\\d{3}"
			}
		}
	],
	"key": "Post",
	"manifestVersion": 4,
	"outputParameters": [
		{
			"description": [
				"Holds the content returned from an HTTP request after any specified extraction or processing rules have been applied.",
				"Provides a way to work with the processed response data instead of the raw body.",
				"Enables automation workflows to access the exact information they need from the HTTP response."
			],
			"name": "HttpResponse",
			"type": "Any"
		},
		{
			"description": [
				"Holds the HTTP response headers returned from an HTTP request.",
				"Contains key-value pairs that provide metadata about the response such as content type, date, and length.",
				"Enables workflows to inspect response details for logging or conditional logic."
			],
			"name": "HttpResponseHeaders",
			"type": "Any"
		},
		{
			"description": [
				"Holds the HTTP status code returned from an HTTP request.",
				"Represents the outcome of the request using a three-digit numeric code.",
				"Enables automation flows to check for success or failure of the HTTP operation.",
				"Supports error handling in workflows based on the status code value."
			],
			"name": "HttpStatusCode",
			"type": "Any"
		}
	],
	"parameters": [
		{
			"description": [
				"Defines the data payload sent with a DELETE request.",
				"Includes extra details the server may need to carry out the deletion.",
				"Helps ensure the API has the context required to process the delete operation."
			],
			"mandatory": false,
			"name": "Body",
			"type": "String"
		},
		{
			"description": [
				"Indicates the format of data sent in the request body.",
				"Helps the server understand how to parse and handle the payload.",
				"Supports formats such as JSON, XML, form data, and plain text."
			],
			"mandatory": false,
			"name": "ContentType",
			"type": "String",
			"values": [
				{
					"description": [
						"Represents JSON data encoded as JavaScript Object Notation.",
						"Allows for structured data that is easy to read and parse."
					],
					"name": "application/json"
				},
				{
					"description": [
						"Denotes a generic binary data stream when the format is unknown.",
						"Enables transferring files or data without predefined structure."
					],
					"name": "application/octet-stream"
				},
				{
					"description": [
						"Identifies Portable Document Format files for documents and forms.",
						"Ensures consistent rendering of printable content."
					],
					"name": "application/pdf"
				},
				{
					"description": [
						"Marks XML data formatted with Extensible Markup Language.",
						"Provides a generic way to represent structured data."
					],
					"name": "application/xml"
				},
				{
					"description": [
						"Specifies MPEG audio encoded in MP3 format.",
						"Offers compressed audio suitable for music and podcasts."
					],
					"name": "audio/mpeg"
				},
				{
					"description": [
						"Indicates JPEG images compressed for photographs.",
						"Balances image quality with file size."
					],
					"name": "image/jpeg"
				},
				{
					"description": [
						"Signals PNG images with lossless compression.",
						"Supports transparent backgrounds for web graphics."
					],
					"name": "image/png"
				},
				{
					"description": [
						"Used for form submissions that include files and text fields.",
						"Allows combining different data types in one request."
					],
					"name": "multipart/form-data"
				},
				{
					"description": [
						"Defines stylesheet content for web page styling in CSS.",
						"Controls layout, colors, and fonts of HTML documents."
					],
					"name": "text/css"
				},
				{
					"description": [
						"Represents HTML content to structure web pages.",
						"Defines elements like headings, paragraphs, and links."
					],
					"name": "text/html"
				},
				{
					"description": [
						"Denotes plain text without special formatting.",
						"Serves simple messages or logs in text form."
					],
					"name": "text/plain"
				},
				{
					"description": [
						"Encodes URL-encoded form data in key-value pairs.",
						"Pairs are separated by ampersands and percent-encoded if needed."
					],
					"name": "application/x-www-form-urlencoded"
				},
				{
					"description": [
						"Specifies MP4 multimedia container for video and audio.",
						"Supports subtitles and still images within the file."
					],
					"name": "video/mp4"
				}
			]
		},
		{
			"description": [
				"Explains how text characters are converted to binary code for transmission.",
				"Ensures the data is encoded and decoded correctly by both sender and receiver.",
				"Allows different encoding standards to maintain compatibility across systems."
			],
			"name": "Encoding",
			"type": "String",
			"values": [
				{
					"description": [
						"Uses 7-bit codes to represent 128 common characters such as letters, digits, and symbols.",
						"Forms the basis for many modern text encoding systems.",
						"Remains compatible with Unicode formats like UTF-8."
					],
					"name": "ASCII"
				},
				{
					"description": [
						"Stores each character in 16 bits with the most significant byte first.",
						"Commonly used on platforms that follow big-endian byte ordering.",
						"Ensures consistent decoding when big-endian formats are required."
					],
					"name": "BigEndianUnicode"
				},
				{
					"description": [
						"Also called ISO-8859-1 and covers many Western European languages.",
						"Uses one byte per character for a total of 256 symbols.",
						"Often used for legacy data but supports fewer characters than Unicode."
					],
					"name": "Latin1"
				},
				{
					"description": [
						"Assigns a unique code point to every character in most writing systems.",
						"Supports global text representation in a single standard.",
						"Forms the foundation for encodings like UTF-8 and UTF-16."
					],
					"name": "Unicode"
				},
				{
					"description": [
						"Encodes text using only 7-bit ASCII characters for safe transmission in restricted systems.",
						"Was originally designed for email use where 8-bit data could be problematic.",
						"Rarely used today because it is less efficient than modern encodings."
					],
					"name": "UTF7"
				},
				{
					"description": [
						"Variable-length encoding that uses one to four bytes per character.",
						"Covers all Unicode code points and is backward-compatible with ASCII.",
						"Widely adopted as the standard text format on the web."
					],
					"name": "UTF8"
				},
				{
					"description": [
						"Uses a fixed four bytes for each character’s code point.",
						"Simplifies text processing by providing a constant width per character.",
						"Consumes more memory but offers straightforward character indexing."
					],
					"name": "UTF32"
				}
			]
		},
		{
			"description": [
				"Defines a form field to include in the request body using key=value pairs.",
				"Encodes each field correctly so the server can read the data.",
				"Lets you send extra parameters when the server requires them during a delete operation."
			],
			"mandatory": false,
			"name": "Field",
			"type": "KeyValue"
		},
		{
			"description": [
				"Enables adding custom headers to an HTTP DELETE request.",
				"Each header uses a name=value format so the server can read it correctly.",
				"Allows you to repeat the parameter to include multiple headers.",
				"Custom headers let you send extra information like authentication tokens or tracing data."
			],
			"mandatory": false,
			"name": "Header",
			"type": "KeyValue"
		},
		{
			"description": [
				"Defines the web address where the delete request is sent.",
				"Tells the server which resource should be removed.",
				"Ensures the correct endpoint is targeted for deletion.",
				"Using an accurate URL helps prevent errors or deleting the wrong resource."
			],
			"mandatory": false,
			"name": "Url",
			"type": "Uri|String"
		}
	],
	"platforms": [
		"Any"
	],
	"pluginType": "HttpMethod",
	"properties": [
		{
			"description": [
				"Specifies where to send the HTTP POST request and what data to include.",
				"Allows dynamic values through templates or variable placeholders in the format {{$...}}.",
				"Makes it possible to customize the request URL or payload at runtime."
			],
			"mandatory": true,
			"name": "Argument",
			"type": "Uri|Expression"
		},
		{
			"description": [
				"Specifies the attribute whose value should be extracted from an element identified by the `OnElement` expression.",
				"Works with XML or HTML responses, returning the value of the given attribute.",
				"Enables precise retrieval of metadata embedded in tags for downstream workflow processing."
			],
			"mandatory": false,
			"name": "OnAttribute",
			"type": "String"
		},
		{
			"description": [
				"Targets specific parts of an API response by using XPath or JSONPath expressions.",
				"Works with both XML and JSON responses.",
				"Adapts to the response format to locate the right element.",
				"Helps ensure the correct data is extracted regardless of the API’s output format."
			],
			"mandatory": false,
			"name": "OnElement",
			"type": "String"
		},
		{
			"description": [
				"Defines a pattern for capturing and extracting specific data from a text response.",
				"Uses standard regular expression syntax to match and retrieve the parts you need.",
				"Enables precise extraction of values embedded in the response.",
				"Helps automate parsing of complex text outputs."
			],
			"mandatory": false,
			"name": "RegularExpression",
			"type": "Regex"
		}
	],
	"protocol": {
		"apiDocumentation": "None",
		"w3c": "None"
	},
	"summary": [
		"The Post plugin lets automation workflows submit data to servers or APIs using HTTP POST requests for consistent data submission.",
		"It supports dynamic URL construction, custom headers, and different content types to handle various payloads easily.",
		"It captures response details to guide subsequent workflow steps in robotic process automation and to verify data submission in automated tests."
	]
}
